/* 
3. Объявить две переменные a и b и задать им целочисленные произвольные начальные значения.
Затем написать скрипт, который работает по следующему принципу:
- если a и b положительные, вывести их разность (ноль можно считать положительным числом);
- если а и b отрицательные, вывести их произведение;
- * (этот пункт по сложнее, делайте по желанию) если а и b разных знаков, вывести их сумму;
*/

let a = +prompt('Введите первое число:');
let b = +prompt('Введите второе число:');

if (a >= 0 && b >= 0) {
    alert(a - b);
} else if (a < 0 && b < 0) {
    alert(a * b);
} else {
    alert(a + b);   // Если a и b не попадают под проверку первых двух условий, то у них разные знаки
}

// Второй вариант для 3 пункта

if ((a >= 0 && b < 0) || (a < 0 && b >= 0)) {
    alert(a + b);
}